# coding: utf-8
import json
import os
import random
from pprint import pprint


def parse_cities(province):
    data = json.load(open("data/{}.json".format(province)))
    ret = {}
    for city in data['features']:
        name = city['properties']['name']
        if '市' == name[-1]:
            name = name[:-1]
        ret[name] = city['properties']['cp']
    return ret


def make_china_map():
    data = {}
    province_name_map = {
        "anhui": "安徽",
        "fujian": "福建",
        "gansu": "甘肃",
        "guangdong": "广东",
        "guangxi": "广西",
        "guizhou": "贵州",
        "hainan": "海南",
        "hebei": "河北",
        "heilongjiang": "黑龙江",
        "henan": "河南",
        "hubei": "湖北",
        "hunan": "湖南",
        "jiangsu": "江苏",
        "jiangxi": "江西",
        "jilin": "吉林",
        "liaoning": "辽宁",
        "neimenggu": "内蒙古",
        "ningxia": "宁夏",
        "qinghai": "青海",
        "shandong": "山东",
        "shanxi": "山西",
        "shanxi1": "陕西",
        "sichuan": "四川",
        "xinjiang": "新疆",
        "xizang": "西藏",
        "yunnan": "云南",
        "zhejiang": "浙江",
    }

    for f in os.listdir('data'):
        province = f[:-5]
        data.update(parse_cities(province))

    extra = {
        '上海': [
            121.472644,
            31.231706
        ],

        '北京': [
            116.405285,
            39.904989
        ],

        '天津': [
            117.190182,
            39.125596
        ],

        '重庆': [
            106.504962,
            29.533155
        ],

        '香港': [
            114.173355,
            22.320048
        ],

        '澳门': [
            113.54909,
            22.198951
        ]
    }
    for city, pos in extra.items():
        data.update({city: pos})
    data.update({
            "台北": [121.5, 25.05],
            "高雄": [120.37, 22.64],
            "基隆": [121.73, 25.14],
            "台中": [120.67, 24.15],
            "台南": [120.19, 22.98],
            "宜兰": [121.75, 24.75],
            "桃园": [121.3, 25],
            "新竹": [120.96, 24.81],
    })
    json.dump(data, open('../app/static/json/china_city.json', 'w'))
    from pprint import pprint
    pprint(data)
    # print(len(data))
    province = random.choice(list(data.keys()))
    city = random.choice(list(data[province]))
    print(province, city)

def make_old_city():
    china_map = json.load(open('china.json'))
    all_city = {}
    for p, d in china_map.items():
        all_city.update(d)

    old_city_info = {}
    old_cities = [
        "北京",
        "承德",
        "大同",
        "南京",
        "苏州",
        "扬州",
        "杭州",
        "绍兴",
        "泉州",
        "景德镇",
        "曲阜",
        "洛阳",
        "开封",
        "江陵",
        "长沙",
        "广州",
        "桂林",
        "成都",
        "遵义",
        "昆明",
        "大理",
        "拉萨",
        "西安",
        "延安",
        "上海",
        "天津",
        "沈阳",
        "武汉",
        "南昌",
        "重庆",
        "保定",
        "平遥",
        "呼和浩特",
        "镇江",
        "常熟",
        "徐州",
        "淮安",
        "宁波",
        "歙县",
        "寿县",
        "亳州",
        "福州",
        "漳州",
        "济南",
        "安阳",
        "南阳",
        "商丘",
        "襄樊",
        "潮州",
        "阆中",
        "宜宾",
        "自贡",
        "镇远",
        "丽江",
        "日喀则",
        "韩城",
        "榆林",
        "武威",
        "张掖",
        "敦煌",
        "银川",
        "喀什",
        "正定",
        "邯郸",
        "新绛",
        "代县",
        "祁县",
        "哈尔滨",
        "吉林",
        "集安",
        "衢州",
        "临海",
        "长汀",
        "赣州",
        "青岛",
        "聊城",
        "邹城",
        "临淄",
        "郑州",
        "浚县",
        "随州",
        "钟祥",
        "岳阳",
        "肇庆",
        "佛山",
        "梅州",
        "雷州",
        "柳州",
        "琼山",
        "乐山",
        "都江堰",
        "泸州",
        "建水",
        "巍山",
        "江孜",
        "咸阳",
        "汉中",
        "天水",
        "同仁",
        "山海关区",
        "凤凰县",
        "濮阳",
        "安庆",
        "泰安",
        "海口",
        "金华",
        "绩溪县",
        "吐鲁番",
        "特克斯县",
        "无锡",
        "南通",
        "北海",
        "宜兴",
        "嘉兴",
        "中山",
        "太原",
        "蓬莱",
        "会理县",
        "库车县",
        "伊宁",
        "泰州",
        "会泽县",
        "烟台",
        "青州",
        "湖州",
        "齐齐哈尔",
        "常州",
        "瑞金",
        "惠州",
        "温州",
    ]

    def part_in(city):
        for c in all_city:
            if city in c:
                return c

    for c in old_cities:
        if c in all_city:
            old_city_info[c] = all_city[c]
        else:
            full_name = part_in(c)
            if full_name:
                old_city_info[c] = all_city[full_name]
            else:
                print(c)
    additional_cities = {
        "曲阜": [117.03179, 35.615761],
        "平遥": [112.265493, 37.14809],
        "江陵": [112.473701, 30.101503],
        "寿县": [116.768939, 32.262396],
        "歙县": [118.575156, 29.871177],
        "常熟": [120.831486, 31.669446],
        "襄樊": [112.176326, 32.094934],
        "镇远": [108.475888, 27.12163],
        "阆中": [106.078093, 31.602117],
        "韩城": [110.393774, 35.582782],
        "敦煌": [94.158042, 40.388771],
        "新绛": [111.172875, 35.631583],
        "祁县": [112.469066, 37.292198],
        "正定": [114.570201, 38.227073],
        "集安": [125.998992, 41.251411],
        "代县": [113.050582, 39.093197],
        "长汀": [116.371884, 25.696958],
        "临海": [121.221919, 28.857389],
        "临淄": [118.300697, 36.854244],
        "邹城": [117.089582, 35.354043],
        "浚县": [114.467186, 35.686206],
        "钟祥": [112.584826, 31.244981],
        "雷州": [110.012636, 20.796584],
        "都江堰": [103.637342, 31.039124],
        "建水": [102.889674, 23.683914],
        "琼山": [110.48011, 19.741334],
        "巍山": [100.178639, 25.246753],
        "江孜": [89.66905, 28.91068],
        "同仁": [102.078449, 35.426829],
        "绩溪县": [118.663777, 30.162401],
        "凤凰县": [109.518882, 28.013633],
        "特克斯县": [82.006852, 42.925564],
        "山海关区": [119.713616, 40.0329],
        "蓬莱": [120.862694, 37.66116],
        "宜兴": [119.790265, 31.362245],
        "会理县": [102.263927, 26.591301],
        "库车县": [83.459807, 41.781933],
        "伊宁": [81.289048, 44.020356],
        "瑞金": [115.985867, 25.921831],
        "青州": [118.470187, 36.680584],
        "会泽县": [103.468544, 26.462218],
    }
    old_city_info.update(additional_cities)

    pprint(old_city_info)

    for c in old_cities:
        if c not in old_city_info:
            print(c)
    json.dump(old_city_info, open('../app/static/json/old_city.json', 'w'))

def make_unusual_city():
    unusual_city = {
        "潮州": [116.630076, 23.661812],
        "恩施市": [109.517433, 30.308979],
        "承德市": [117.933822, 40.992521],
        "东川": [103.078562, 26.139329],
        "丹东": [124.338543, 40.129023],
        "赣州": [114.935909, 25.845296],
        "广元": [105.819687, 32.44104],
        "蓟县": [117.441159, 40.009614],
        "靖江": [120.276899, 32.039443],
        "临海": [121.221919, 28.857389],
        "泉州": [118.600362, 24.901652],
        "日照": [119.50718, 35.420225],
        "漠河": [122.715721, 52.945659],
        "三门峡": [111.181262, 34.78332],
        "汕头": [116.72865, 23.383908],
        "上饶": [117.955464, 28.457623],
        "寿县": [116.768939, 32.262396],
        "台州": [121.440613, 28.668283],
        "天水": [105.736932, 34.584319],
        "威海": [122.093958, 37.528787],
        "黔东南": [107.985353, 26.583992],
        "兴化": [119.996418, 32.961954],
        "兴城": [120.475527, 40.596284],
        "烟台": [121.309555, 37.536562],
        "伊宁县": [81.75694, 44.008117],
        "宜宾": [104.633019, 28.769675],
        "元阳": [102.819567, 23.069203],
        "长汀": [116.371884, 25.696958],
        "镇远县": [108.475888, 27.12163],
        "正定": [114.570201, 38.227073],
        "舟山": [122.169872, 30.03601],
        "钟祥": [112.584826, 31.244981],
    }
    json.dump(unusual_city, open('../app/static/json/unusual_city.json', 'w'))

if __name__ == '__main__':
    make_china_map()
